app/Controllers/Producto_controller.php

    public function activarProducto($id) {
        $session = session();
        if ($session->get('perfil_id') != 1) {
            return redirect()->to('/');
        }
        $productoModel = new Productos_model();

        // Verificar si el producto existe y está eliminado
        $producto = $productoModel->find($id);
        if (!$producto || $producto['eliminado'] == 'NO') {
            session()->setFlashdata('error', 'El producto no existe o ya está activo.');
            return redirect()->to('productos_eliminados');
        }

        // Reactivar el producto
        $productoModel->update($id, ['eliminado' => 'NO']);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '5'
UPDATE `productos` SET `eliminado` = 'NO'
WHERE `productos`.`id` IN ('5')