app/Controllers/Usuario_controller.php

    public function actualizarUsuario($id) {


        $usuarioModel = new Usuarios_model();

        if (!$usuarioModel->find($id)) {
            session()->setFlashdata('error', 'El usuario no existe.');
            return redirect()->to('listar_usuarios');
        }

        $data = [
            'nombre' => $this->request->getVar('nombre'),
            'apellido' => $this->request->getVar('apellido'),
            'usuario' => $this->request->getVar('usuario'),
            'email' => $this->request->getVar('email'),
            'perfil_id' => $this->request->getVar('perfil_id'),
        ];

        $usuarioModel->update($id, $data);
---
UPDATE `usuarios` SET `nombre` = 'admin', `apellido` = 'test', `usuario` = 'admin1', `email` = 'admin@gmail.com', `perfil_id` = '2'
WHERE `usuarios`.`id_usuario` IN ('16')