app/Controllers/Ventas_controller.php

    public function listar_ventas() {
        $ventasModel = new Ventas_cabecera_model();
        $usuariosModel = new Usuarios_model(); // Para obtener lista de usuarios

        $usuario_id = $this->request->getGet('usuario_id');
        $fecha_inicio = $this->request->getGet('fecha_inicio');
        $fecha_fin = $this->request->getGet('fecha_fin');
        $total_inicio = $this->request->getGet('total_inicio');
        $total_fin = $this->request->getGet('total_fin');

        $total_inicio = is_numeric($total_inicio) ? $total_inicio : null;
        $total_fin = is_numeric($total_fin) ? $total_fin : null;

        $data['ventas'] = $ventasModel->getTodasLasVentas($usuario_id, $fecha_inicio, $fecha_fin, $total_inicio, $total_fin);

        $data['usuarios'] = $usuariosModel->findAll(); // Obtener lista de usuarios para el filtro
---
SELECT *
FROM `usuarios`