app/Models/Categorias_model.php

SELECT `id`, `descripcion`
FROM `categorias`
WHERE `activo` = 1
---
    public function getCategorias() {
        return $this->select('id, descripcion')->where('activo', 1)->get()->getResultArray();