app/Models/Consultas_model.php

    public function getConsultasAll() {
        return $this->findAll();
---
SELECT *
FROM `consultas`

    public function getConsultasEliminadas() {
        return $this->where('estado', 'CONSULTA ELIMINADA')->findAll();
---
SELECT *
FROM `consultas`
WHERE `estado` = 'CONSULTA ELIMINADA'