app/Models/Productos_model.php

    public function getProductoAll() {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `productos`