app/Models/Usuarios_model.php

SELECT *
FROM `usuarios`
---
    public function getClientesAll() {
        return $this->findAll();