app/Models/Ventas_detalle_model.php

    public function getVentasDetalle() {
        return $this->findAll();
---
SELECT *
FROM `ventas_detalle`