app/Models/Ventas_cabecera_model.php

SELECT `ventas_cabecera`.`id_ventas_cabecera`, `ventas_cabecera`.`fecha`, `ventas_cabecera`.`total_venta`, `productos`.`id`, `productos`.`nombre_prod`, `productos`.`marca`, `productos`.`imagen`, `ventas_detalle`.`cantidad`, `ventas_detalle`.`precio`
FROM `ventas_cabecera`
JOIN `ventas_detalle` ON `ventas_detalle`.`venta_id` = `ventas_cabecera`.`id_ventas_cabecera`
JOIN `productos` ON `productos`.`id` = `ventas_detalle`.`producto_id`
WHERE `ventas_cabecera`.`usuario_id` = '10'
ORDER BY `ventas_cabecera`.`fecha` DESC
---
    public function getHistorialCompras($usuario_id) {
    return $this->db->table('ventas_cabecera')
                    ->select('ventas_cabecera.id_ventas_cabecera, ventas_cabecera.fecha, ventas_cabecera.total_venta, productos.id, productos.nombre_prod, productos.marca, productos.imagen, ventas_detalle.cantidad, ventas_detalle.precio')
                    ->join('ventas_detalle', 'ventas_detalle.venta_id = ventas_cabecera.id_ventas_cabecera')
                    ->join('productos', 'productos.id = ventas_detalle.producto_id')
                    ->where('ventas_cabecera.usuario_id', $usuario_id)
                    ->orderBy('ventas_cabecera.fecha', 'DESC')
                    ->get()
                    ->getResultArray();